; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v6 ?v9)
             (pred_5 ?v4 ?v7)
             (pred_10 ?v6 ?v7)
             (pred_4 ?v12 ?v6 )
	     (pred_11 ?v6)
             (pred_12 ?v8)
             (pred_9 ?v4)
             (pred_2 ?v7)
             (pred_7 ?v6)
             (pred_3 ?v4)
             (pred_8 ?v6)
             (pred_6 ))



(:action op_1
:parameters (?v11 ?v2 ?v1 ?v13)
:precondition (and (pred_12 ?v11) (pred_12 ?v2) (pred_9 ?v1) (pred_2 ?v13)
          (pred_1 ?v11 ?v2) (pred_5 ?v1 ?v13)
                   (pred_10 ?v2 ?v13) (pred_11 ?v11) 
                   (pred_7 ?v2) (pred_3 ?v1))
:effect (and  (pred_8 ?v2) (not (pred_7 ?v2))))


(:action op_5
:parameters (?v11 ?v10)
:precondition (and (pred_12 ?v11) (pred_12 ?v10)
               (pred_11 ?v11) (pred_1 ?v11 ?v10) (pred_8 ?v10))
:effect (and (pred_11 ?v10) (not (pred_11 ?v11))))

(:action op_4
:parameters (?v11 ?v1)
:precondition (and (pred_12 ?v11) (pred_9 ?v1) 
                  (pred_11 ?v11) (pred_4 ?v1 ?v11) (pred_6 ))
:effect (and (pred_3 ?v1)
   (not (pred_4 ?v1 ?v11)) (not (pred_6 ))))


(:action op_2
:parameters (?v11 ?v3 ?v5)
:precondition (and (pred_12 ?v11) (pred_9 ?v3) (pred_9 ?v5)
                  (pred_11 ?v11) (pred_3 ?v5) (pred_4 ?v3 ?v11))
:effect (and (pred_3 ?v3) (pred_4 ?v5 ?v11)
        (not (pred_3 ?v5)) (not (pred_4 ?v3 ?v11))))

(:action op_3
:parameters (?v11 ?v1)
:precondition (and (pred_12 ?v11) (pred_9 ?v1) 
                  (pred_11 ?v11) (pred_3 ?v1))
:effect (and (pred_6 ) (pred_4 ?v1 ?v11) (not (pred_3 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_15 obj_28 obj_24 obj_30 obj_07 obj_22 obj_06 obj_01 obj_10 obj_08 obj_03 obj_05 obj_11 obj_13 obj_18 obj_21 obj_14 obj_23 obj_20 obj_29 obj_27 obj_26 obj_04 obj_09
    obj_17 obj_02
    obj_25 obj_12 obj_16
    )

    (:init
       (pred_6)

       (pred_12 obj_19)
       (pred_12 obj_15)
       (pred_12 obj_28)
       (pred_12 obj_24)
       (pred_12 obj_30)
       (pred_12 obj_07)
       (pred_12 obj_22)
       (pred_12 obj_06)
       (pred_12 obj_01)
       (pred_12 obj_10)
       (pred_12 obj_08)
       (pred_12 obj_03)
       (pred_12 obj_05)
       (pred_12 obj_11)
       (pred_12 obj_13)
       (pred_12 obj_18)
       (pred_12 obj_21)
       (pred_12 obj_14)
       (pred_12 obj_23)
       (pred_12 obj_20)
       (pred_12 obj_29)
       (pred_12 obj_27)
       (pred_12 obj_26)
       (pred_12 obj_04)
       (pred_12 obj_09)
       (pred_2 obj_17)
       (pred_2 obj_02)
       (pred_9 obj_25)
       (pred_9 obj_12)
       (pred_9 obj_16)

       (pred_1 obj_19 obj_07)
       (pred_1 obj_19 obj_15)
       (pred_1 obj_15 obj_22)
       (pred_1 obj_15 obj_28)
       (pred_1 obj_15 obj_19)
       (pred_1 obj_28 obj_06)
       (pred_1 obj_28 obj_24)
       (pred_1 obj_28 obj_15)
       (pred_1 obj_24 obj_01)
       (pred_1 obj_24 obj_30)
       (pred_1 obj_24 obj_28)
       (pred_1 obj_30 obj_10)
       (pred_1 obj_30 obj_24)
       (pred_1 obj_07 obj_08)
       (pred_1 obj_07 obj_22)
       (pred_1 obj_07 obj_19)
       (pred_1 obj_22 obj_03)
       (pred_1 obj_22 obj_06)
       (pred_1 obj_22 obj_15)
       (pred_1 obj_22 obj_07)
       (pred_1 obj_06 obj_05)
       (pred_1 obj_06 obj_01)
       (pred_1 obj_06 obj_28)
       (pred_1 obj_06 obj_22)
       (pred_1 obj_01 obj_11)
       (pred_1 obj_01 obj_10)
       (pred_1 obj_01 obj_24)
       (pred_1 obj_01 obj_06)
       (pred_1 obj_10 obj_13)
       (pred_1 obj_10 obj_30)
       (pred_1 obj_10 obj_01)
       (pred_1 obj_08 obj_18)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_08 obj_07)
       (pred_1 obj_03 obj_21)
       (pred_1 obj_03 obj_05)
       (pred_1 obj_03 obj_22)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_05 obj_14)
       (pred_1 obj_05 obj_11)
       (pred_1 obj_05 obj_06)
       (pred_1 obj_05 obj_03)
       (pred_1 obj_11 obj_23)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_11 obj_01)
       (pred_1 obj_11 obj_05)
       (pred_1 obj_13 obj_20)
       (pred_1 obj_13 obj_10)
       (pred_1 obj_13 obj_11)
       (pred_1 obj_18 obj_29)
       (pred_1 obj_18 obj_21)
       (pred_1 obj_18 obj_08)
       (pred_1 obj_21 obj_27)
       (pred_1 obj_21 obj_14)
       (pred_1 obj_21 obj_03)
       (pred_1 obj_21 obj_18)
       (pred_1 obj_14 obj_26)
       (pred_1 obj_14 obj_23)
       (pred_1 obj_14 obj_05)
       (pred_1 obj_14 obj_21)
       (pred_1 obj_23 obj_04)
       (pred_1 obj_23 obj_20)
       (pred_1 obj_23 obj_11)
       (pred_1 obj_23 obj_14)
       (pred_1 obj_20 obj_09)
       (pred_1 obj_20 obj_13)
       (pred_1 obj_20 obj_23)
       (pred_1 obj_29 obj_27)
       (pred_1 obj_29 obj_18)
       (pred_1 obj_27 obj_26)
       (pred_1 obj_27 obj_21)
       (pred_1 obj_27 obj_29)
       (pred_1 obj_26 obj_04)
       (pred_1 obj_26 obj_14)
       (pred_1 obj_26 obj_27)
       (pred_1 obj_04 obj_09)
       (pred_1 obj_04 obj_23)
       (pred_1 obj_04 obj_26)
       (pred_1 obj_09 obj_20)
       (pred_1 obj_09 obj_04)
       (pred_7 obj_21)
       (pred_7 obj_26)
       (pred_7 obj_05)
       (pred_10  obj_21 obj_17)
       (pred_10  obj_26 obj_02)
       (pred_10  obj_05 obj_17)
       (pred_8 obj_19)
       (pred_8 obj_15)
       (pred_8 obj_28)
       (pred_8 obj_24)
       (pred_8 obj_30)
       (pred_8 obj_07)
       (pred_8 obj_22)
       (pred_8 obj_06)
       (pred_8 obj_01)
       (pred_8 obj_10)
       (pred_8 obj_08)
       (pred_8 obj_03)
       (pred_8 obj_11)
       (pred_8 obj_13)
       (pred_8 obj_18)
       (pred_8 obj_14)
       (pred_8 obj_23)
       (pred_8 obj_20)
       (pred_8 obj_29)
       (pred_8 obj_27)
       (pred_8 obj_04)
       (pred_8 obj_09)

       (pred_5  obj_25 obj_17)
       (pred_5  obj_12 obj_02)
       (pred_5  obj_16 obj_02)
       (pred_4 obj_25 obj_27)
       (pred_4 obj_12 obj_24)
       (pred_4 obj_16 obj_11)
       (pred_11 obj_27)
    )

    (:goal (and
       (pred_4 obj_12 obj_26)
    ))
(:constraints
  (always (not (pred_11 obj_14)))
)
)

; plan
1. (op_4 obj_27 obj_25)
   deleted: (pred_4 obj_25 obj_27) (pred_6)
   added: (pred_3 obj_25)
   goals met: 0 of 1
2. (op_1 obj_27 obj_21 obj_25 obj_17)
   deleted: (pred_7 obj_21)
   added: (pred_8 obj_21)
   goals met: 0 of 1
3. (op_5 obj_27 obj_21)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_21)
   goals met: 0 of 1
4. (op_3 obj_21 obj_25)
   deleted: (pred_3 obj_25)
   added: (pred_6) (pred_4 obj_25 obj_21)
   goals met: 0 of 1
5. (op_5 obj_21 obj_03)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_03)
   goals met: 0 of 1
6. (op_5 obj_03 obj_22)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_22)
   goals met: 0 of 1
7. (op_5 obj_22 obj_06)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_06)
   goals met: 0 of 1
8. (op_5 obj_06 obj_01)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_01)
   goals met: 0 of 1
9. (op_5 obj_01 obj_24)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_24)
   goals met: 0 of 1
10. (op_4 obj_24 obj_12)
   deleted: (pred_4 obj_12 obj_24) (pred_6)
   added: (pred_3 obj_12)
   goals met: 0 of 1
11. (op_5 obj_24 obj_01)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_01)
   goals met: 0 of 1
12. (op_5 obj_01 obj_11)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_11)
   goals met: 0 of 1
13. (op_5 obj_11 obj_23)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_23)
   goals met: 0 of 1
14. (op_5 obj_23 obj_04)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_04)
   goals met: 0 of 1
15. (op_1 obj_04 obj_26 obj_12 obj_02)
   deleted: (pred_7 obj_26)
   added: (pred_8 obj_26)
   goals met: 0 of 1
16. (op_5 obj_04 obj_26)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_26)
   goals met: 0 of 1
17. (op_3 obj_26 obj_12)
   deleted: (pred_3 obj_12)
   added: (pred_6) (pred_4 obj_12 obj_26)
   goals met: 1 of 1
